/**
 * 1 常用模型 背包问题
 * 2 线性dp
 * 3 区间dp
 */
#include <iostream>
using namespace std;

/**
 * 0-1背包
 * n个物品 每个物品体积 vi 利润 wi  一个背包总容量V 挑选物品不超过背包的容量 使得利润最大
 * !每个物品最多只用一次
 */

/**
 * N = 4 V= 5
 * 体积   价值
 *  1     2
 *  2     4
 *  3     4
 *  4     5
*/

/**
 * 完全背包
 * n个物品 每个物品体积 vi 利润 wi  一个背包总容量V 挑选物品不超过背包的容量 使得利润最大
 * !每个物品可以使用无限次
 */

/**
 * 多重背包
 * n个物品 每个物品体积 vi 利润 wi  一个背包总容量V 挑选物品不超过背包的容量 使得利润最大
 * !每个物品可以使用s[i]次
 */

/**
 * 多重背包
 * n个物品 每个物品体积 vi 利润 wi  一个背包总容量V 挑选物品不超过背包的容量 使得利润最大
 * !每个组里面的物品只能用一次
 */